Repository: m0hamed-elnagar/fard
Catalog: lib/core/l10n/app_*.arb
Languages: ar

# appTitle
source: Fard - Qada Tracker
ar: فرض - Qada Tracker

source: Daily Prayers
ar: صلوات اليوم

source: Remaining
ar: المتبقي

# appName
source: Fard
ar: فرض

# errorOccurred
source: An error occurred
ar: حدث خطأ ما

source: Retry
ar: إعادة المحاولة

# onboardingTitle1
source: Track Your Prayers
ar: تتبع صلواتك

# onboardingDesc1
source: Keep a record of your daily prayers and never miss a beat.
ar: احتفظ بسجل لصلواتك اليومية ولا تفوت أي صلاة.

# onboardingTitle2
source: Manage Qada
ar: إدارة القضاء

# onboardingDesc2
source: Easily track and complete your missed prayers over time.
ar: تتبع وأكمل صلواتك الفائتة بسهولة مع مرور الوقت.

source: Get Started
ar: ابدأ الآن

source: Hello World!
ar: أهلاً بالعالم!

source: Calendar
ar: التقويم

source: History
ar: سجل الشهر

# noHistory
source: No history for this month
ar: لا يوجد سجل لهذا الشهر

source: Delete Record
ar: حذف السجل

# deleteConfirm
source: Are you sure you want to delete the record for {date}?
ar: هل أنت متأكد من حذف سجل يوم {date}؟

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Missed {count}
ar: فاتت {count}

source: Add Qada
ar: إضافة قضاء

source: Total Qada
ar: إجمالي القضاء

source: By Count
ar: بالعدد

source: By Time
ar: بالوقت

source: Add
ar: إضافة

# selectPeriod
source: Select period to calculate prayers
ar: حدد الفترة لحساب عدد الصلوات

source: From
ar: من

source: To
ar: إلى

source: Select Date
ar: اختر تاريخ

source: Days Count
ar: عدد الأيام

source: Prayers per fard
ar: صلاة لكل فرض

# missedDaysTitle
source: Missed Days
ar: أيام فائتة

# missedDaysMessage
source: It looks like you missed {count} days since your last record. Were you praying during this period? If not, they will be added to your remaining prayers.
ar: يبدو أنك فوت {count} أيام منذ آخر سجل. هل كنت تصلي خلال هذه الفترة؟ إذا لم تكن كذلك، فسيتم إضافتها إلى صلواتك المتبقية.

source: Yes
ar: نعم

source: No
ar: لا

# skip
source: I was praying
ar: كنت أصلي

# addAll
source: Add to remaining
ar: إضافة للمتبقي

source: Edit
ar: تعديل

source: Update
ar: تحديث

source: Edit Qada
ar: تعديل القضاء

source: Next
ar: التالي

source: Fajr
ar: فجر

source: Dhuhr
ar: ظهر

source: Asr
ar: عصر

source: Maghrib
ar: مغرب

source: Isha
ar: عشاء

source: Settings
ar: الإعدادات

source: Location Settings
ar: إعدادات الموقع

source: Current Location
ar: الموقع الحالي

source: Prayer Settings
ar: إعدادات الصلاة

source: Calculation Method
ar: طريقة الحساب

source: Madhab
ar: المذهب

source: Language
ar: اللغة

# locationDesc
source: Enables precise calculation of prayer times based on your current coordinates.
ar: تفعيل الحساب الدقيق لمواقيت الصلاة بناءً على إحداثيات موقعك الحالي.

# calculationMethodDesc
source: Select the authority used in your region for calculating Fajr and Isha angles.
ar: اختر الجهة المعتمدة في منطقتك لحساب زوايا الفجر والعشاء.

# madhabDesc
source: Determines the calculation for Asr prayer time (Hanafi vs. other schools).
ar: يحدد طريقة حساب وقت صلاة العصر (الحنفي مقابل المذاهب الأخرى).

# shafiMadhab
source: Shafi, Maliki, Hanbali
ar: شافعي، مالكي، حنبلي

# hanafiMadhab
source: Hanafi
ar: حنفي

source: Refresh Location
ar: تحديث الموقع

source: Location not set
ar: الموقع غير محدد

source: Azkar Settings
ar: إعدادات الأذكار

source: Morning Azkar
ar: أذكار الصباح

source: Evening Azkar
ar: أذكار المساء

# azkarSettingsDesc
source: Configure what time to show morning and evening Azkar reminders.
ar: قم بتكوين الوقت المناسب لعرض تذكيرات أذكار الصباح والمساء.

# autoAzkarTimes
source: Auto (Follow Prayer Times)
ar: تلقائي (حسب مواقيت الصلاة)

# autoAzkarTimesDesc
source: Automatically set Azkar times based on Fajr and Asr prayers.
ar: تحديد مواعيد الأذكار تلقائياً بناءً على صلاتي الفجر والعصر.

source: Time for
ar: حان وقت

source: Recommended
ar: مقترح

source: Azkar
ar: الأذكار

source: Loading Azkar...
ar: جاري تحميل الأذكار...

source: Error Loading Azkar
ar: خطأ في تحميل الأذكار

source: No categories found
ar: لم يتم العور على فئات

source: Refresh Data
ar: تحديث البيانات

source: Reset All Progress
ar: إعادة تعيين التقدم

# noItemsFound
source: No items found in this category
ar: لم يتم العثور على عناصر في هذه الفئة

source: Reset Item
ar: إعادة تعيين العنصر

# prayerTab
source: Prayer
ar: الصلاة

# azkarTab
source: Azkar
ar: الأذكار

source: Search...
ar: بحث...

# noSearchResults
source: No search results found
ar: لم يتم العثور على نتائج للبحث

# searchCategory
source: Search for a category...
ar: ابحث عن فئة...

source: Select Category
ar: اختر الفئة

# azanSettings
source: Azan & Reminder Settings
ar: إعدادات الأذان والتنبيهات

source: Azan
ar: الأذان

source: Reminder
ar: التنبيه

# minutesBefore
source: {minutes} minutes before
ar: قبل {minutes} دقائق

source: Azan Voice
ar: صوت الأذان

source: Enable Azan
ar: تفعيل الأذان

source: Enable Reminder
ar: تفعيل التنبيه

source: Qibla
ar: القبلة

# afterSalahAzkar
source: Azkar after Salah
ar: الأذكار بعد الصلاة

# afterSalahAzkarDesc
source: Reminder to read azkar 15 minutes after azan
ar: تنبيه لقراءة الأذكار بعد 15 دقيقة من الأذان

source: Quran
ar: القرآن الكريم

source: Loading Quran...
ar: جاري تحميل القرآن...

source: Error Loading Quran
ar: خطأ في تحميل القرآن

# searchSurah
source: Search for a Surah...
ar: البحث عن سورة...

source: Ayah
ar: آية

source: Surah
ar: سورة

# quranTab
source: Quran
ar: القرآن

# tasbihTab
source: Tasbih
ar: تسبيح

source: Tasbih
ar: المسبحة

source: Select Dhikr Category
ar: اختر فئة الذكر

source: Tasbih Settings
ar: إعدادات المسبحة

source: Haptic Feedback
ar: الاهتزاز عند اللمس

source: Show Translation
ar: إظهار الترجمة

source: Show Transliteration
ar: إظهار النطق

source: Reset Counter?
ar: إعادة تعيين العداد؟

# resetProgressWarning
source: This will reset your current progress to zero.
ar: سيؤدي هذا إلى إعادة ضبط تقدمك الحالي إلى الصفر.

# finishAndReset
source: Finish & Reset
ar: إنهاء وإعادة تعيين

# errorLoadingTasbih
source: Error loading Tasbih data
ar: خطأ في تحميل بيانات المسبحة

# rememberDua
source: Remember this Dua
ar: تذكر هذا الدعاء

source: Change Dua
ar: تغيير الدعاء

# duaSaved
source: Dua saved for next time
ar: تم حفظ الدعاء للمرات القادمة

source: Finish
ar: إنهاء

# tasbih_after_salah_name
source: Tasbih after Salah
ar: الأذكار بعد الصلاة

# tasbih_after_salah_desc
source: 33x SubhanAllah, Alhamdulillah, Allahu Akbar + Dua
ar: 33 مرة: سبحان الله، الحمد لله، الله أكبر + الدعاء

# tasbih_fatimah_name
source: Tasbih Fatimah (Bedtime)
ar: تسبيح الزهراء (عند النوم)

# tasbih_fatimah_desc
source: 33x SubhanAllah, 33x Alhamdulillah, 34x Allahu Akbar
ar: 33 مرة: سبحان الله، الحمد لله، و34 مرة: الله أكبر

# four_foundations_name
source: The Four Foundations
ar: الباقيات الصالحات

# four_foundations_desc
source: SubhanAllah, Alhamdulillah, La ilaha illallah, Allahu Akbar
ar: سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر

# yunus_dhikr_name
source: Dhikr of Prophet Yunus
ar: دعاء ذي النون

# yunus_dhikr_desc
source: La ilaha illa anta subhanaka...
ar: لا إله إلا أنت سبحانك إني كنت من الظالمين

# morning_evening_name
source: Morning & Evening Adhkar
ar: أذكار الصباح والمساء

# morning_evening_desc
source: Daily remembrances for morning and evening
ar: الأذكار اليومية للمسلم

# istighfar_name
source: Istighfar
ar: الاستغفار

# istighfar_desc
source: Seeking Allah's forgiveness
ar: طلب المغفرة من الله عز وجل

# salat_ibrahimiyyah_name
source: Salat Ibrahimiyyah
ar: الصلاة الإبراهيمية

# salat_ibrahimiyyah_desc
source: Salutations upon the Prophet (PBUH)
ar: الصلاة على النبي صلى الله عليه وسلم

# tahlil_takbir_tahmid_name
source: Tahlil, Takbir & Tahmid
ar: التهليل والتكبير والتحميد

# tahlil_takbir_tahmid_desc
source: Fundamental declarations of faith
ar: إعلان التوحيد والتمجيد لله

# quran_adhkar_name
source: Adhkar from Quran
ar: أذكار من القرآن الكريم

# quran_adhkar_desc
source: Supplications directly from the Quran
ar: أدعية من كتاب الله عز وجل

# ruqyah_protection_name
source: Ruqyah & Protection
ar: الرقية والتحصين

# ruqyah_protection_desc
source: Supplications for protection from harm
ar: أدعية الحماية والتحصين من الشرور

source: Choose Completion Dua
ar: اختر دعاء الختام

# locationWarning
source: Prayer times cannot be calculated without your location.
ar: لا يمكن معرفة مواقيت الصلاة بدون تحديد الموقع.

source: Give Permission
ar: تفعيل الموقع

# afterSalaahAzkar
source: Azkar al-Salaah
ar: أذكار بعد الصلاة

# minutesAfter
source: {minutes} minutes after
ar: بعد {minutes} دقائق

# qadaTracker
source: Missed Prayers Tracker
ar: تتبع الصلوات الفائتة (القضاء)

# qadaTrackerDesc
source: Track missed prayers (Qada) and set goals to complete them.
ar: تتبع الصلوات التي فاتتك وحدد أهدافاً لإتمامها.

# qadaOnboardingTitle
source: Qada Tracking
ar: تتبع القضاء

# qadaOnboardingDesc
source: Would you like to track your missed prayers (Qada) and set goals to complete them?
ar: هل تود تتبع صلواتك الفائتة (القضاء) وتحديد أهداف لإتمامها؟

# enableQada
source: Enable Qada Tracking
ar: تفعيل تتبع القضاء

# disableQada
source: Disable for now
ar: تعطيل الآن

# globalSettings
source: Global Notification Settings
ar: إعدادات التنبيهات للكل

# globalSettingsDesc
source: Apply these settings to all five prayers at once.
ar: تطبيق هذه الإعدادات على جميع الصلوات الخمس معاً.

# individualSettings
source: Individual Prayer Settings
ar: إعدادات كل صلاة على حدة

source: Apply to all
ar: تطبيق على الكل

# generalSettings
source: General App Settings
ar: إعدادات التطبيق العامة
